tsung/tsung_config_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <!--  Client side setup  -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  <!--  Server side setup  -->
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <!--  Set connection timeout to 2 seconds  -->
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>
    <!-- signup : this will create a user and store the id in uid -->
    <session name="sign up, edit" type="ts_http" weight="1">

      <!-- generate a random number before user creation each time -->
      <setdynvars sourcetype="random_number" start="1" end="100000">
        <var name="uid_prefix" />
      </setdynvars>

      <!-- create a user and store its id in uid -->
      <request subst="true">
        <dyn_variable name="uid" jsonpath="$.id"/>
        <http url="/users" method="POST" version="1.1" content_type="application/x-www-form-urlencoded"
              contents="email=%%_uid_prefix%%-hi.pack@g.com&amp;password=test_password&amp;password_confirmation=test_password&amp;first_name=hi.pack&amp;last_name=hi.lastname"/>
      </request>

      <!--
      <request subst="true">
        <http url="/users/%%_uid%%" method="PATCH" version="1.1" content_type="application/x-www-form-urlencoded"
              contents="last_name=new_lastname"/>
      </request>
      -->

      <!-- create a new event for the user with id `uid`, store the created event's id in eid-->
      <request subst="true">
        <dyn_variable name="eid" jsonpath="$.id"/>
        <http url="/events" method="POST" version="1.1" content_type="application/x-www-form-urlencoded"
              contents="user_id=%%_uid%%&amp;host_name=%%_uid%%pack&amp;location_name=blah&amp;street_address=home&amp;start_time=12345&amp;end_time=45666&amp;title=bday&amp;description=25;commit=add_event for user_id: %%_uid%%"/>
      </request>

      <!-- create an invite -->
      <for var="i" from="1" to="5">
      <request subst="true">
        <dyn_variable name="invite_id" jsonpath="$.id" />
        <http url="/invites" method="POST" version="1.1" content_type="application/x-www-form-urlencoded" contents="user_id=%%_uid%%&amp;message=please_come! to the event: %%_eid%% invite_number: %%_i%%&amp;guest_email=%%_uid_prefix%%-hi.pack-guest@g.com&amp;event_id=%%_eid%%"/>
      </request>
      </for>

      <!-- GET list of all events for this user -->
      <request subst="true">
        <dyn_variable name="events_list" jsonpath="$..*"/>
        <http url="/events" method="GET" version="1.1" content_type="application/x-www-form-urlencoded" contents="user_id=%%_uid%%"/>
      </request>

      <!-- GET list of all invites for this user with the event_ids fetched above -->
      <!--
      <request subst="true">
        <http url="/invites" method="GET" version="1.1" content_type="application/x-www-form-urlencoded" contents="user_id=%%_uid%%&amp;event_id=%%"/>
      </request>
      -->

      <!-- GET events details for event with id `eid` -->
      <request subst="true">
        <http url="/events/%%_eid%%" method="GET"/>
      </request>

      <!-- GET all events -->
      <request>
        <http url="/events" method="GET"/>
      </request>

    </session>
  </sessions>
</tsung>